//展示各种界面 
#include <string.h>

int menu(void)
{
	puts("********************************");
	puts("*                              *");
	puts("*     小型商品信息管理系统     *");
	puts("*                              *");
	puts("********************************");
	putchar('\n');
	puts("********************************");
	puts("*    请选择您想进行的操作：    *");
	puts("*        0) 退出程序           *");
	puts("*        1) 录入进货单         *");
	puts("*        2) 添加星级客户       *");
	puts("*        3) 售货模式           *");
	puts("*        4) 待添加             *");
	puts("********************************");
	putchar('\n');
	puts("请输入进行的操作序号："); 
	int cus;
	scanf("%d",&cus);
	return cus;
}
