//展示各种界面 
#include <string.h>
#include "ui.h"

//程序的标题 
void title(void)
{
	puts("********************************");
	puts("*                              *");
	puts("*     小型商品信息管理系统     *");
	puts("*                              *");
	puts("********************************");
	putchar('\n');
}

//管理员菜单 
void admin(void)
{
	puts("********************************");
	puts("*        管理员操作菜单        *");
	puts("*        11) 录入进货单        *");
	puts("*        12) 星级客户管理      *");
	puts("*        13) 数据管理          *");
	//没有最后一行，是故意为之 
}

//通用菜单 
int menu(void)
{
	puts("********************************");
	puts("*        1) 售货模式           *");
	puts("*        2) 帮助               *");
	puts("*        0) 退出程序           *");
	puts("********************************");
	putchar('\n');
	puts("请输入进行的操作序号："); 
	int cus;
	scanf("%d",&cus);
	return cus;
}

//商品录入 
void goods_in(void){
	puts("********************************");
	puts("*                              *");
	puts("*       进货单录入模式         *");
	puts("*                              *");
	puts("********************************");
	putchar('\n');
	//这里还会有一个获取时间函数 
	//这里接上黄志写的模块 
}

//星级客户
void add_cus(void)
{
	puts("********************************");
	puts("*                              *");
	puts("*       星级客户管理后台       *");
	puts("*                              *");
	puts("********************************");
	putchar('\n');
	//这里接上张开严写的模块 
} 

//数据管理 
void data(void)
{
	puts("********************************");
	puts("*                              *");
	puts("*         数据管理后台         *");
	puts("*                              *");
	puts("********************************");
	putchar('\n');
	//这里还会接上其他东西 
}

//售货模式
void sell(void)
{
	puts("********************************");
	puts("*                              *");
	puts("*       欢迎光临本超市！       *");
	puts("*                              *");
	puts("********************************");
	putchar('\n');
	//待完善 
} 

//帮助文档
void help(void)
{
	puts("********************************");
	puts("*                              *");
	puts("*             帮助             *");
	puts("*                              *");
	puts("********************************");
	putchar('\n');
} 
