//展示各种界面 
#include "ui.h"

//程序的标题 
void title(void)
{
	puts("********************************");
	puts("*                              *");
	puts("*     小型商品信息管理系统     *");
	puts("*                              *");
	puts("********************************");
	putchar('\n');
}

//管理员菜单 
void admin(void)
{
	puts("********************************");
	puts("*        管理员操作菜单        *");
	puts("*        11) 录入进货单        *");
	puts("*        12) 星级客户管理      *");
	puts("*        13) 数据管理          *");
	puts("*        14) 登录账户管理      *"); 
	//没有最后一行，是故意为之 
}

//通用菜单 
int menu(void)
{
	puts("********************************");
	puts("*        1) 售货模式           *");
	puts("*        2) 帮助               *");
	puts("*        0) 退出程序           *");
	puts("********************************");
	putchar('\n');
	puts("请输入进行的操作序号："); 
	int cus;
	scanf("%d",&cus);getchar();
	return cus;
}

//商品录入 
void goods_in(void){
	puts("********************************");
	puts("*                              *");
	puts("*       进货单录入模式         *");
	puts("*                              *");
	puts("********************************");
	putchar('\n');
	//这里还会有一个获取时间函数 
	//这里接上黄志写的模块 
}

//星级客户
void add_cus(void)
{
	puts("********************************");
	puts("*                              *");
	puts("*       星级客户管理后台       *");
	puts("*                              *");
	puts("********************************");
	putchar('\n');
	//这里接上张开严写的模块 
} 

//数据管理 
void data(void)
{
	puts("********************************");
	puts("*                              *");
	puts("*         数据管理后台         *");
	puts("*                              *");
	puts("********************************");
	putchar('\n');
	//这里还会接上其他东西 
}

//登录用户管理
void users(void)
{
	puts("********************************");
	puts("*                              *");
	puts("*       登录账户管理后台       *");
	puts("*                              *");
	puts("********************************");
	putchar('\n');	
} 

//售货模式
void sell(void)
{
	puts("********************************");
	puts("*                              *");
	puts("*       欢迎光临本超市！       *");
	puts("*                              *");
	puts("********************************");
	putchar('\n');
	//待完善 
} 

//帮助文档
void help(int adm)
{
	system("cls");
	puts("********************************");
	puts("*                              *");
	puts("*     小型商品信息管理系统     *");
	puts("*           使用帮助           *");
	puts("*                              *");
	puts("********************************");
	ENTER ENTER
	
	if(adm==1)
	{
		puts("********************************");
		puts("*      系统管理员专属功能      *");
		puts("********************************");
		ENTER
		puts("进货，进行商品信息的录入");
		puts("a.从系统自动获取进货时间");
		puts("b.输入商品数据并保存");
		ENTER
		puts("星级客户管理");
		puts("a.读入客户名单");
		puts("b.手动修改客户的星级");
		ENTER
		puts("选择数据管理");
		puts("a.商品信息的查询与修改");
		puts("b.商品数据统计");
		ENTER 
		puts("管理系统用户");
		puts("a.修改用户的权限");
		puts("b.增加新用户"); 
		ENTER 
	}
	puts("售货模式使用");
	puts("a.根据商品ID或者名称读入客户购买的商品");
	puts("  （商品ID可通过扫描条形码自动录入或者手动输入）");
	puts("b.读入星级客户卡号进行折扣与消费额度记录");
	ENTER 
	system("pause"); 
	system("cls");
} 
